Artillery/session_store/session_load.yml
config:
  target: "http://localhost:8080"
  phases:
    - name: "steady load"
      duration: 5
      arrivalRate: 20
    - name: "ramp up"
      duration: 5
      arrivalRate: 5
      rampTo: 100
    - name: "slow down"
      duration: 5
      arrivalRate: 15
      rampTo: 10
  defaults:
    headers:
      Content-Type: "application/x-www-form-urlencoded"
  plugins:
    fake-data: {} # Falso plugin to fake data for the user

scenarios:
  - flow:
    - post:
        log: "Creating user"
        url: "/signup"
        form:
          username: "{{ $randUserName() }}" # fake-data plugin function
          password: "webdeviscool"
        capture:
          - json: "$.username"
            as: "username"
    - post:
        log: "Logging in {{ $username }}"
        url: "/login"
        form:
          username: "{{ username }}" # Reuse the username from the previous request result
          password: "webdeviscool"
    - get:
        log: "Getting profile {{ $username }}"
        url: "/profile"